//by Antoni Rucinski & Jacek Pi\u0142ka

menu.mainMenu=Plik
menu.simulationMenu=Symulacja
menu.saveMenuItem=Zapisz
menu.closeMenuItem=Zamknij
menu.startStopMenuItem=Start/Stop
menu.symulationOptionsMenuItem=Opcje symulacji
menu.help=Pomoc naukowa

interface.title=Symulator Bomby Atomowej
interface.maxEnergy=Energia maksymalna [J]:
interface.currentEnergy=Energia obecna [J]:
interface.maxEnergykTNT=Energia maksymalna [kTNT]:
interface.currentEnergykTNT=Energia obecna [kTNT]:
interface.chart=Wykres
interface.table=Tabela
interface.chartEnergy=Energia
interface.chartAtoms=Liczba atomów
interface.chartNeutrons=Liczba neutronów
interface.chartFissions=Liczba rozszczepie\u0144
interface.endSimulationDialogTitle=Zako\u0144czenie symulacji
interface.endSimulationDialogMessage=Symulacja zosta\u0142a zako\u0144czona

options.title=Opcje symulacji
options.element = Pierwiastek
options.shape = Kszta\u0142t próbki
options.surroundingMaterial=Materia\u0142 otaczaj\u0105cy
options.weight=Waga próbki
options.element1 = Uran
options.element2= Pluton
options.shape1=Kula
options.shape2=Sze\u015Bcian
options.yes=Tak
options.no=Nie
options.radius = promie\u0144 [m]
options.edge = kraw\u0119d\u017A [m]
options.giveMass=Podaj mas\u0119 próbki.
options.giveRadius=Podaj warto\u015B\u0107
options.dimension=Wymiary
options.accuracy=Typ symulacji
options.accuracy1=Szybka
options.accuracy2=Zbalansowana
options.accuracy3=Dok\u0142adna
options.massErrorTitle=Za du\u017Ce warto\u015Bci!
options.massError=Warto\u015Bci s\u0105 za du\u017Ce! Maksymalna warto\u015B\u0107 masy: 499.

options.tip.mass=Podaj mas\u0119 próbki. Maks: 499.
options.tip.shape=Podaj warto\u015B\u0107
options.tip.elements=Wybierz pierwiastek
options.tip.shapes=Wybierz kszta\u0142t próbki
options.tip.material=Czy jest materia\u0142 otaczaj\u0105cy?
options.tip.type=Czy wykona\u0107 szybsz\u0105, ale mniej dok\u0142adn\u0105 symulacj\u0119, czy te\u017C wolniejsz\u0105, ale dok\u0142adniejsz\u0105?

save.title=Zapisz wyniki
save.button=Zapisz
save.fileType=Pliki tekstowe

cWarning.title=B\u0142\u0119dne ustawienia!
cWarning.message=Dane wpisane w "Opcje symulacji" s\u0105 niepoprawne. Aby poprawi\u0107 wci\u015Bnij popraw.
cWarning.Correct=Popraw

chart.title=Wykres
chart.energy=Energia
chart.X=Czas [ns]
chart.Yenergy=Energia [kTNT]
chart.Yatoms=Atomy
chart.Yneutrons=Neutrony
chart.Yfissions=Rozszczepienia
chart.Y=Warto\u015B\u0107

table.time=Czas [ns]
table.energy=Energia [J]
table.energykTNT=Energia [kTNT]
table.numberOfAtoms=Atomy
table.numberOfNeutrons=Neutrony
table.numberOfFissions=Rozszczepienia


edu.title=Pomoc naukowa
edu.buttonA=Bro\u0144 j\u0105drowa
edu.nuclearWeapon=Bro\u0144 j\u0105drowa \u2013 rodzaj broni masowego ra\u017Cenia wykorzystuj\u0105cej  wewn\u0105trzj\u0105drow\u0105 energi\u0119 wydzielan\u0105 podczas  niekontrolowanej \u0142a\u0144cuchowej reakcji rozszczepienia j\u0105der ci\u0119\u017Ckich pierwiastków (uranu i plutonu \u2013 bro\u0144 atomowa) lub reakcji termoj\u0105drowej syntezy lekkich pierwiastków z wodoru \u2013 bomba wodorowa \u2013 o sile wybuchu znacznie wi\u0119kszej od broni atomowej. Podobnie do ka\u017Cdego innego rodzaju broni, bro\u0144 j\u0105drowa jest trudna do jednoznacznego zdefiniowania. Jednak wed\u0142ug ameryka\u0144skiego Departamentu Obrony, broni\u0105 j\u0105drow\u0105 jest kompletne urz\u0105dzenie w jego zamierzonej ostatecznej konfiguracji, które po zako\u0144czeniu procedur i procesów uzbrojenia, fuzji oraz sekwencji odpalenia, zdolne jest do produkcji zamierzonej reakcji nuklearnej oraz uwolnienia energii. \n \n \u017Aród\u0142o: wikipedia.pl
edu.buttonB=Masa krytyczna
edu.criticalMass=Masa krytyczna materia\u0142u rozszczepialnego \u2013 minimalna masa, w której reakcja rozszczepienia przebiega w sposób \u0142a\u0144cuchowy, czyli ka\u017Cde jedno rozszczepienie j\u0105dra atomowego inicjuje dok\u0142adnie jedno nast\u0119pne rozszczepienie. W masie mniejszej od masy krytycznej reakcja zainicjowana rozszczepieniem spontanicznym zaniknie, w masie wi\u0119kszej od masy krytycznej reakcja b\u0119dzie przebiega\u0142a w sposób lawinowy, tzn. jedno rozszczepienie wywo\u0142a wi\u0119cej ni\u017C jedno rozszczepienie. \n \n \u017Aród\u0142o: wikipedia.pl
edu.buttonC=Reakcja \u0142a\u0144cuchowa
edu.chainReaction=Reakcja \u0142a\u0144cuchowa \u2013 szczególny rodzaj reakcji chemicznej lub j\u0105drowej. Po zainicjowaniu reakcja przebiega pocz\u0105tkowo tylko w niewielkiej cz\u0119\u015Bci o\u015Brodka, lecz jej produkty \u2013 ciep\u0142o, \u015Bwiat\u0142o, reaktywne produkty po\u015Brednie \u2013 inicjuj\u0105 reakcj\u0119 w kolejnym punkcie o\u015Brodka, na skutek czego rozwija si\u0119 ona lawinowo bez potrzeby udzia\u0142u zewn\u0119trznego czynnika inicjuj\u0105cego. \n \n \u017Aród\u0142o: wikipedia.pl